



학술 논문 작성 요령


ISD 연구실
김창욱교수 
2018. 08. 03
 

Epilogue

본 문건은 지도교수가 이제껏 연구실의 대학원생들을 지도하면서 느낀 점을 모아 정리한 내용입니다. 논문을 작성해야 하는 학생들이 반드시 숙지하면 좋은 내용을 담아 보았습니다. 학생 개개인 입장에서는 지도교수가 모든 걸 가르쳐 주길 바라겠지만 지도교수는 한 명이 아닌 여러 명을 동시에 논문 지도해야 하는 입장입니다. 같은 실수를 반복하면 지도교수가 지쳐 갑니다. 때로는 여러 분 개개인도 기분이 나쁠 수도 있을 겁니다. 이런 비 효율적인 상황을 청산하기 위해서 좋은 논문을 작성하는데 도움이 되는 시스템을 도입하는 것이 좋겠다고 판단하야 본 문건을 작성했습니다. 이제 여러분도 학술 논문 작성 요령을 숙지하길 바라며, 본문 중에서 미진한 부분이 있으면 건의 바랍니다. 우리 모두 좋은 시스템을 완성해 나가는데 노력합시다.

2018년 8월 3일 무더운 여름 오후에…
 
학술 논문 작성 요령

■ 논문을 작성해야 할 즈음…
	1. 논문 주제를 찾는다. 되도록 현장 문제 위주로 작지만 깊이 있는 주제로 설정한다.
	2. 논문 주제의 배경 그리고 중요성을 고민한다.
	3. 필요한 데이터를 획득한다 (우리는 데이터 사이언티스트이니까….)
	4. 해당 논문 주제를 다루는 기존 연구 논문을 찾아 숙독한다 (Key papers가 아닌 이상 최근 10년내의 논문 위주로 정리)
	5. 기존 논문을 숙독하면서 어떻게 논문을 전개해 나갔는지 면밀히 분석한다 (“음~ 이렇게 논문을 쓰는구나”를 느껴 본다. 나중에 논문을 작성할 때 도움이 되기 때문에).
	6. 가능하면 기존 논문의 방법을 카테고리별로 정리하고 카테고리별 장단점을 파악한다.
	7. 기존 연구 대비 새로운 방법을 제안하고 데이터를 이용해 구현한다.
	8. 기존 연구에서 비교 방법을 정하고 실험 계획을 수립하고 비교 실험을 진행한다. 비교 방법이 마땅치 않으면 제안 방법의 우수성만을 입증해도 된다.
	9. 본인이 원하는 결과가 나왔으면 논문 작성 단계로 넘어가고 그렇지 못하면 (7)번으로 돌아 가거나, 최악의 경우 (1)번으로 간다.

■ 논문을 작성하기 전에 한번 더...
	10. 논문 배경, 논문 주제, 그리고 주제의 중요성을 다시 명확히 정리한다.
	11. 제안 방법을 정리한다 (기존 연구 대비 왜 제안 방법이 논문 주제에 적합한지를 다시 한번 더 고민).
	12. 실험 결과를 바탕으로 기존 연구 방법 대비 어떤 점에서 제안 방법이 우수한지를 정리한다.
	13. (12)번 결과를 바탕으로 기존 방법은 해결하지 못한 점을 제안 방법이 해결했다면 이를 바탕으로 논문 주제의 중요성을 구체적으로 재정리한다.
	14. 본인이 제안한 방법의 한계점을 정리하고 이를 바탕으로 향후 연구 주제를 생각해 본다.


■ 논문을 작성할 때...
	15. 논문은 “줄거리가 있는 새로운 이야기”다. 소설을 쓰듯이 기승전결(起承轉結)이 있어야 한다.
	16. 그리고 잘 쓰여진 소설처럼 관심있는 모든 사람이 읽어도 이해가 가도록 친절하고 세밀하게 작성되어야 한다 (정성이 녹아 있지 않은 상태로 작성된 논문을 지도교수에게 보여주는 것은 큰 실례다).
	17. 모든 용어는 일관성 있게 사용되어야 하며, 영어와 한글이 혼용되어 문장을 이루면 안 된다 (한글 논문이면 되도록 한글로 표현). 
	18. 중복된 얘기가 자주 나와서는 안 된다 (논문 배경, 주제, 중요성이 아직 세밀하게 정의되어 있지 못하다는 증거).
	19. 배경, 주제, 중요성을 설명하는 단락(paragraph)마다 주장과 근거가 담겨 있으면 좋다.

■ 논문 구성
	20. 논문은 일반적으로 double space, 10-sized font로 25장 내외로 작성한다. 
	21. 제안 방법의 신뢰성을 높이기 위해 실험부분 설명이 50% 정도 차지해야 한다.
	22. 구체적인 논문 구성은 아래와 같다
Abstract (Introduction 내용을 요약해서 설명하며 일반적으로 200자 내외로 작성)
	- 연구 배경, 주제, 중요성 소개.
	- 기존 연구의 (카테고리별) 문제점 소개.
	- 제안 방법 소개 (어떤 방법으로 기존 문제를 해결했는지 소개).
	- 실험 결과 요약.

Introduction (起承轉結의 起에 해당하며, 제일 작성하기 까다로운 부분)
	- 연구 배경, 주제, 중요성 소개 (기존문헌을 인용하여 좀 더 설득력 있게 보일 것).
	- (유사한) 연구 주제를 다룬 기존 연구의 (카테고리별) 문제점 소개 (기존문헌 인용) – 과거형.
	- 제안 방법과 contribution 간단하게 소개 (어떤 독창성을 가지고 문제점을 해결했는지를 부각).
	- 실험결과의 우수성을 간단하게 소개 – 과거형.
	- 논문 구성(차례) 소개.

Literature survey (起承轉結의 起에 해당하며, 최신 논문 위주로 설명하되 수식 사용하지 말 것) – 과거형 
	- 카테고리별로 기존 개별 연구를 소개 (연구 대상, 가정, 방법론을 핵심 위주로 간략하게 소개)하고 카테고리별로 한계점을 지적.
	- 기존 연구 대비 제안 방법론의 장점을 간단하게 재 설명.

Backgrounds (option)
	- 제안 방법의 기본이 되는 알고리즘이 있다면 이 절에서 소개.
	- 또는 논문 주제의 배경이 되는 상황에 대한 구체적인 설명이 필요하다면 소개.

Proposed method (起承轉結의 承에 해당)
	- 용어와 수식을 이용하여 제안 방법론을 자세히 소개 (글로 표현해도 되는 부분을 불필요한 수식을 사용하여 혼란스럽게 하지 말 것).
	- 제안 방법이 다단계 알고리즘으로 구성되어 있으면 overview 소단원을 만들어 순서도를 이용하여 간략하게 설명한 후, 세부 알고리즘을 소단원 별로 소개.

Experiment (起承轉結의 轉에 해당) – 과거형
	- 실험 데이터 설명.
	- 비교 방법 및 실험 설계 설명.
	- 성능지표 설명.
	- 실험 결과 및 분석에서는 제안 방법의 우수성을 보여주는 그림과 표를 전문가 수준으로 작성하고 설명하되, 단순히 그림이나 표의 결과를 나열하기 보다 결과의 의미를 해석할 것.

Conclusion (起承轉結의 結에 해당) – 과거형
	- 제안 방법의 핵심을 재 소개하면서 장점을 실험결과를 이용해서 부각.
	- 제안 방법의 한계를 소개하면서 향후 연구 주제를 논의.


Acknowledgement (Option)
	- 특정 과제의 사사 표기법에 따를 것.

References (저널 양식에 맞게 표현)
	- 특히 참고문헌을 달 때 부주의하게 실수하는 학생이 많은데 저널 양식에 맞게 꼼꼼히 작성할 것.

■ 기타
	23. 타겟 학술지는 문헌 조사를 하는 과정에서 결정하면 좋다. 
	24. 학술지별로 양식 (참고문헌 나열 방식, 참고문헌 인용 방식, 수식과 표 방식, 단원 제목 양식 등)이 다르다. 따라서 타겟 학술지가 정해지면 양식에 맞게 논문을 정리해야 한다.
	25. 모든 참고문헌은 인용되어야 하며, 인용된 참고문헌은 모두 참고문헌 리스트에 나열되야 한다.
	26. 논문에서 그림과 표는 장식용이 아니다. 반드시 표나 그림을 설명하는 단락이 반드시 있어야 한다. 
	27. 영어 단어의 약자를 사용할 때 반드시 처음에는 full name을 쓰고 괄호안에 약자를 표기한 다음, 그 후부터 약자를 사용해야 한다 (예: fault detection and classification (FDC)….. FDC is a key technology….). 약자를 쓰고 괄호안에 full name이 있으면 안 된다.
	28. 초록과 본문은 별개라고 생각하고 약자는 각각 다시 정의해야 한다.
	29. 영어 논문에서 괄호는 단어와 one space 띠워야 한다 
(예: fault detection and classification (FDC))
	30. 영어 논문에서 글이 시작되는 첫 문자는 항상 대문자로 통일한다. 나머지는 모두 소문자로 처리한다.
  31. 모든 수학 기호 (x, y 등도 포함)는 equation editor를 사용하며 이탤릭체로 표현한다.
	32. 수식은 문장의 일부분이다. 반드시 period를 찍거나 where 등 뒤 문장이 이어지면 comma를 사용한다.
예: y=ax+b. In this equation…
예: y=ax+b, where a and b are the slope and intercept, respectively.
	33. 수식은 표를 이용해 정리하고 테두리를 없앤다 (관리하기 편함).

Prologue
논문을 작성해서 지도교수에게 보내기 전에 반드시 위의 모든 사항을 점검하길 바랍니다.

